Revit 2024 API
RebarShapeConstraintArcLength Class
 An arc-length constraint associated with an arc in a RebarShapeDefinition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class RebarShapeConstraintArcLength : RebarShapeConstraint
Visual Basic
Public Class RebarShapeConstraintArcLength _
	Inherits RebarShapeConstraint
Visual C++
public ref class RebarShapeConstraintArcLength : public RebarShapeConstraint
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength
See Also
RebarShapeConstraintArcLength Members
Autodesk.Revit.DB.Structure Namespace